package telegram

import "utils/ranges"

const (
	q1              = "1. Что такое POIZON?"
	q2              = "2. Как авторизоваться в POIZON? 🪪 Через android & iphone?"
	q3              = "3. Как работает интерфейс POIZON? 🚠"
	q4              = "4. Оригинальная ли продукция?💯"
	q5              = "5. Почему именно Карманный Казах? 🤠"
	q6              = "6. Как заказывать товары с POIZON? 🛍️"
	q7              = "7. Как посмотреть внешний вид, как товар будет выглядеть в реальной жизни? 🌇"
	q8              = "8. Как искать товар по фото? 📸"
	q9              = "9. Как искать товар только по определенным параметрам? 🎚️"
	q10             = "10. Как заказывать б/у на что ориентироваться? 👜"
	faqMenuTemplate = "" +
		"❔Часто задаваемые вопросы ❔"

	faqAns1 = "" +
		"1. Что такое POIZON?\n\n" +
		"Poizon —  это китайская торговая площадка, специализирующаяся на продаже оригинальных кроссовок" +
		"👟одежды 👘коллекционных вещей 🤑 и аксессуаров 👜 Китайский маркетплейс схож с " +
		"известными Wildberries или OZON,но главное различие между Poizon и другими в том, что каждый товар " +
		"сначала отправляется на платформу в качестве склада для идентификации и проверки на оригинальность.\n\n" +
		"Как заявляют в Poizon, за последние 7 лет были приложены огромные усилия и потрачен " +
		"значительные ресурсы для выстраивания процесса идентификации вещей"
	faqAns2 = "" +
		"2. Как авторизоваться в POIZON? Через android & iphone?\n\n" +
		"Скачай приложение:\n" +
		"iOS по <a href=\"https://apps.apple.com/ru/app/%E5%BE%97%E7%89%A9-%E6%9C%89%E6%AF%92%E7%9A%84%E8%BF%90%E5%8A%A8" +
		"-%E6%BD%AE%E6%B5%81-%E5%A5%BD%E7%89%A9/id1012871328\">ссылке</a>\n" +
		"Android по <a href=\"https://m.anxinapk.com/rj/12201303.html\">ссылке</a>\n\n" +
		"Проходи авторизацию 🔐\n" +
		"Вместо Китая в общем списке стран выбирай добавочную цифру России +7 🇷🇺 Дописывай свой номер телефона, " +
		"соглашайся с политикой пользования, конфиденциальности и уведомления 📳 нажимай " +
		"на бирюзовую кнопку посередине и жди код 🧑‍💻 (он может не прийти с первого раза, " +
		"поэтому можешь повторно нажать на серые китайские иероглифы указанные прямо перед твоим номером телефона," +
		" для повторной отправки кода) ♻️\n\n" +
		"P.S. даже не пробуй дозвониться на указанный мною номер, это сделано в качестве примера 🆘🆘🆘"

	faqAns3 = "" +
		"3. Как работает интерфейс POIZON?\n\n" +
		"Изначально POIZON позиционировал себя как соц. сеть 🕸️ в которой Китайцы 🇨🇳хвастались своими вещами, " +
		"потом ввели модификацию в качестве отметок товара прямо на фото пользователя\n\n" +
		"После появился маркетплейс 📈 на первой странице которого осталась соц. сеть с новостной лентой 🙋‍♀️🙋‍♂️на " +
		"второй вкладке магазин, где выбираются и добавляются товары в корзину 🧺 третий раздел это служба поддержки " +
		"🛟 через него можно выйти в раздел «95» или б/у.\n\n" +
		"Четвертым является твой аккаунт 🥷но т.к. мы не граждане Китая, то данный раздел нам не доступен и попросту " +
		"не нужен. Поскольку он создан для внутреннего рынка самой страны 🇨\n\n" +
		"Через второй раздел ты сможешь найти необходимый товар как в текстовом поисковике на английском, так и по " +
		"фото Также здесь можно посмотреть отзывы о товаре и увидеть то, как он выглядит на человеке 🤷‍♂️если это " +
		"одежда 👗🥋 Тут же будут представлены доступные размеры и цены к ним на иностранной валюте (Юань) 💴\n\n" +
		"Как выяснилось, вторым разделом ты будешь пользоваться чаще всего 👀 В следующих гайдах я тебя научу " +
		"правильно им пользоваться и ты узнаешь обо всех фичах, которые я представил. А так не забывай использовать " +
		"фото 🌌 переводчик Яндекса из китайского 🇨🇳языка в русский"
	faqAns4_1 = "" +
		"4. Оригинальная ли продукция?🦧🔮\n\n" +
		"Давай разберём контроль оригинальности на примере кроссовок 👟Все начинается с того, что работники проверяют " +
		"целостность внутренней и внешней стороны обувной коробки 🗃️ смотрят соответствует ли стандарту форма обуви, " +
		"язычок и шнурки — учитывают все мелочи 🪙\n\n" +
		"В качестве подтверждения проверки сотрудники делают снимки 📸 которые потом еще долго хранятся. Только для " +
		"одной пары обуви фотографируется внешний вид кроссовок, этикетка с размером и боковая этикетка коробки 🌌🌇🌄\n\n" +
		"Проверяют POIZON не только обувь: для каждой категории товаров каждого бренда есть свой профессиональный " +
		"оценщик 🧑‍🚀который знает, как определить, где оригинал ✅ а где фейк❌"

	faqAns4_2 = "" +
		"Большинство покупателей POIZON получают теги #️⃣ и сертификаты 🪪 с QR - кодами\n\n" +
		"Именно сертификаты и теги чаще всего подделывают пытаясь выдать паль под видом оригинала❌\n\n" +
		"Слева можно увидеть оригинальный сертификат ✅ и тег. Он напечатан на глянцевой бумаге 📄 она более дорогая " +
		"и не оставляет отпечатков после прикосновений 👍Под QR - кодом указан тег (номер кроссовок),  " +
		"который совпадает с ободком. " +
		"При сканировании  QR - кодов открывается вкладка конкретного товара 🎯 а не общей безименной странички POIZON!\n\n" +
		"Подделочный сертификат в свою очередь напечатан на дешевой матовой бумаге 🧻 и под QR – кодом не указан " +
		"номер кроссовок ❌т.к. его там и нет! Код ведет на общую страничку POIZON и не является оригинальным🤨 Если все " +
		"же код кроссовок был указан под сертификатом то можно также легко определить оригинальность – в приложении при " +
		"проверке QR - кода снизу по переходу на страничку товара указано количество сканирований и если оно больше 5, " +
		"то тег является вариацией 🆘 публично слитой в сеть 🏴‍☠️🏴‍☠️и все, кому она попалась переходили по ссылке на этот товар 🚸\n\n" +
		"Чаще всего в репликах указывается даже не тот товар 👖который у тебя есть по факту 👗отличие координальное. " +
		"Один из вариаций тегов находится справа (подделочный сертификат).\n\n" +
		"Никаких желтых❌красных❌фиолетовых❌или других цветов, кроме ✅бирюзового✅что использует POIZON нет и быть не может!\n\n" +
		"Проверяй свои QR - коды через приложение пойзон (не через камеру)! 👨‍💻\n\n" +
		"Все реплики можно купить на Авито, Алиэкспресс, Таобао и 16-88, они сильно отличаются в цене " +
		"🥬(если говорить о юанях 💴) а вот стоимость в рублях явно могут завысить 💹 на POIZON тоже есть " +
		"шанс приобрести паль, но он равен 3% и с нашей стороны мы предоставляем полную гарантию безопасности 👮‍♀️👮‍♂️т.к. " +
		"при поступлении товара на наш склад в Китае 🇨🇳 доверенное лицо проверяет комплектность и оригинальность товара ✅ " +
		"попутно отправляя фотографии 🌃для фиксации приемки товара и соответствия качества 🥩"

	faqAns5 = "" +
		"5. Почему именно Карманный Казах?\n\n" +
		"1. 👨‍👩‍👧‍👦 Семья – рекомендации, предостережения, забота в нашей группе.\n" +
		"2. 🛫 Скорость - кратчайшее время штатной доставки составляет от 8 до 15 дней из Китая 🇨🇳в Россию. P.S." +
		" у нас есть экспресс, который доставит посылку в Россию 🇷🇺за 4 дня\n" +
		"3. 🥬 Цена – она лучше, чем у конкурентов – заходи в калькулятор бота и убедись в этом @xKK_ru_bot \n" +
		"4. 🏋️‍♂️ Качество – не смотря на низкую цену и быстрейшую доставку, товар не потеряет ни единого свойства.  \n" +
		"5. 🤖Весь процесс автоматизирован через бота.\n" +
		"6. 💬Быстрая обратная связь от команды.\n" +
		"7. 💷 Возврат денежных средств в течение одного дня в случае обнаружения реплики на складе POIZON.\n" +
		"8. 🎧 <a href=\"https://music.yandex.ru/album/5778957/track/43427615?utm_medium=copy_link\">Песня</a> понравилась," +
		" но это обычное совпадение!))"

	faqAns6 = "" +
		"6. Как заказывать товары с POIZON? 🤔\n\n" +
		"Заходи в POIZON, открывай раздел во второй вкладке✌️\n\n" +
		"Забивай в поисковике 🕵️‍♂️ необходимый товар 📎 на английском языке 🇬🇧 Нажимай на товар, далее на бирюзовую " +
		"кнопку справа снизу 👇чтобы выбрать размер или комплектацию 4️⃣1️⃣ \n\n" +
		"Обязательно сравни EU с US т.к. они отличаются и можно ошибиться с размером 👽👽\n\n" +
		"Выбирай подходящий размер, под ним будет указана стоимость в юанях 💴 \n\n" +
		"Закрывай окно с размерами и нажми на два облака для копирования ссылки 💬 Теперь необходимо нажать на кнопку " +
		"ссылки 📄 убрать ненужную информацию 🈲 как показано на примере и отправить ссылку, выбранный размер 4️⃣1️⃣и " +
		"стоимость товара боту 💴 @xKK_ru_bot 🤖\n\n" +
		"Все, первая позиция отправлена в корзину ✅ При желании ты можешь редактировать корзину🧺 прямо в боте и " +
		"закреплять 📎 в корзине столько, сколько нужно."

	faqAns7 = "" +
		"7. Как посмотреть внешний вид, как товар будет выглядеть в реальной жизни? 🐸\n\n" +
		"Необходимо ввести запрос нужного товара в поисковике 🔍найти подходящий вариант 👀 зайти в " +
		"карточку товара и спуститься чуть ниже👇Именно там будут живые фотки покупателей 🛍️"

	faqAns8 = "" +
		"8. Как искать товар по фото? 🌇\n\n" +
		"Справа от поисковика в разделе маркетплейса есть иконка фотоаппарата 📷 нажимай на нее и оттуда ты " +
		"можешь загрузить фотографию любого товара 💄либо сделать ее в настоящий момент 📸"

	faqAns9_1 = "" +
		"9. Как искать товар только по определенным параметрам? 🚩\n\n" +
		"Заходи в маркетплейс POIZON, нажимай на крайнюю кнопку справа (три полоски) 🎚️ Выбирай необходимую категорию. " +
		"Допустим я хочу заказать мужскую термофутболку  NIKE до 400 юаней 💴 L размера. Захожу в раздел модной одежды " +
		"(четвертая категория сверху) 4️⃣ либо раздел бренды 🧥"
	faqAns9_2 = "" +
		"Мне предлагаются группы товаров, выбираю подходящий, где предполагается футболки 👕 и лонгсливы 🥼Нажимаю, " +
		"меня переносит в новое окно ⏩ далее необходимо нажать на значок воронки (настройки) ⚙️"
	faqAns9_3 = "" +
		"Выбрал необходимый потолок цены 🥬 свой пол 👨‍🏭👩‍🚀 размер и бренд 🧢\n\n" +
		"Все возможные  предлагаемые варианты можно посмотреть, если нажать на треугольники (справа сбоку) 🔽\n\n" +
		"После настройки нажми на бирюзовую кнопку снизу «применить» ✅ Готово теперь предложены все возможные варианты " +
		"мужских футболок/лонгсливов по определенной цене 💴 размеру 4️⃣1️⃣ и бренду. Пользуйся! 🦥"

	faqAns10_1 = "" +
		"10. Как заказывать б/у на что ориентироваться? 🕵️‍♂️\n\n" +
		"Заказ оформляется абсолютно также в нашем боте как и обычный заказ 🐥\n\n" +
		"Товар можно посмотреть как в выше указанном приложении на <a href=\"https://apps.apple.com/ru/app/" +
		"%E5%BE%97%E7%89%A9-%E6%9C%89%E6%AF%92%E7%9A%84%E8%BF%90%E5%8A%A8-%E6%BD%AE%E6%B5%81-%E5%A5%BD%E7%89%A9/" +
		"id1012871328\">iOS</a> & <a href=\"https://m.anxinapk.com/rj/12201303.html\">Android</a>, " +
		"так и в новом отдельном приложении доступном только для <a href=\"https://apps.apple.com/app/id1488709429\">iOS</a> ✨\n\n" +
		"Товары на 95POIZON подразделяются по следующим категориям 📊Они указаны на каждой фотографии товара:\n\n" +
		"S 级：самый высокий рейтинг - дефекты на коробке 💯\n" +
		"SS级：незаметные дефекты 🔝\n" +
		"AA级：почти как уровень S 👀\n" +
		"A级：маленький дефект на кроссовках,помятая коробка 👟📦 \n" +
		"B级：как секонд хэнд 🙉🙈"

	faqAns10_2 = "" +
		"Заходи в приложение POIZON с любого устройства 📲 в третью вкладку – службу поддержки 3️⃣\n\n" +
		"Третьей строкой, где в тексте указана цифра 95 есть ссылка на сервис б/у товаров 🏄‍♂️ таким образом можно " +
		"перейти и смотреть только б/у товары.\n\n" +
		"Заказываются они абсолютно также как и новые 🔄Тут важно обращать внимание на качество дефекта 💯"
	faqAns10_3 = "" +
		"На представленном выше примере показаны шаги оценки товара 🕵️‍♂️ \n\n" +
		"В качестве проведенной экспертизы товара была указана надпись «пятна»🐷 и соответствующая стрелка ⬅️ на " +
		"место, где они находятся.\n\n" +
		"Чтобы понять суть дефекта рекомендую использовать переводчик с картинок от Яндекс 🌇\n\n" +
		"Мой вывод по представленному примеру: если очень хочется сумку 👜 от GUCCI, а 🥬 не столько, сколько хотелось " +
		"бы, то можно рассмотреть вариант покупки б/у, т.к. дефект можно исправить качественной хим. чисткой 🫧🧽 а " +
		"экономия по итогу составит 68 290 рублей. Новая сумка стоит 85 396 р, а б/у 17 106р в " +
		"нашем боте @xKK_ru_bot🤖 (по курсу валюты 11,6 Р на 1 юань )"
)

var (
	questions = [][]string{
		// dino level
		{q1, q2, q3, q4, q5},
		// boss level
		{q6, q7, q8},
		// master level
		{q9, q10},
	}

	answers = [][]string{
		{faqAns1},
		{faqAns2},
		{faqAns3},
		{faqAns4_1, faqAns4_2},
		{faqAns5},
		{faqAns6},
		{faqAns7},
		{faqAns8},
		{faqAns9_1, faqAns9_2, faqAns9_3},
		{faqAns10_1, faqAns10_2, faqAns10_3},
	}

	imageURLs = [][]string{
		{"https://storage.yandexcloud.net/poison-production/1q.jpg"},
		{"https://storage.yandexcloud.net/poison-production/2q.jpg"},
		{},
		{"https://storage.yandexcloud.net/poison-production/4_q.jpg"},
		{"https://storage.yandexcloud.net/poison-production/5_q.jpg"},
		{},
		{},
		{},
		{},
		{},
	}

	videoFileURLS = []string{
		"",
		"",
		"3_q.MP4",
		"",
		"",
		"6_8q.MP4",
		"7_q.MOV",
		"6_8q.MP4",
		"9_q.MP4",
		"10_q.MP4",
	}
	answersWithLinks = []int{2, 5, 10}
)

func GetAnswers(n int) []string {
	if n > len(answers) {
		return nil
	}
	_ = answers[n-1]
	return answers[n-1]
}

func GetImageURLs(n int) ([]string, bool) {
	if n > len(imageURLs) {
		return nil, false
	}
	_ = imageURLs[n-1]
	if len(imageURLs[n-1]) == 0 {
		return nil, false
	}

	return imageURLs[n-1], true
}

func AnswerHasLink(n int) bool {
	if n > len(answers) {
		return false
	}

	return ranges.In(n, answersWithLinks)
}

func GetVideoPath(n int) string {
	if n > len(videoFileURLS) {
		return ""
	}
	_ = videoFileURLS[n-1]
	return "videos/" + videoFileURLS[n-1]
}

func GetBaseImageURL() string {
	return "https://storage.yandexcloud.net/poison-production/1q.jpg"
}
