package templates

const (
	q1 = "1. Оригинальна ли техника?"
	q2 = "2. Что входит в указанную стоимость?"
	q3 = "3. Какое качество у товара?"
	q4 = "4. Представлены глобальные версии товаров?"
	q5 = "5. Какая вилка у зарядки устройства ?"
	q6 = "6. Почему возите только китайские версии?"
	q7 = "7. Откуда привозится техника?"
	q8 = "8. Откуда привозится техника Apple?"

	ans1 = "Вся техника представленная в каталоге оригинальная и закупается у проверенных поставщиков" +
		" или же напрямую у дилеров от производителей 🏭 "
	ans2 = "В стоимость входит товар, страховка, растаможка, обрешетка и его доставка " +
		"до Москвы 🏙️Стоимость отправки товара в ваш регион оплачивается отдельно🙋‍♂️ "
	ans3 = "Весь товар в магазине является новым 💯 В редких случаях для проверки товар " +
		"распаковывают на таможне 🚛 \n\nПо твоей просьбе мы можем распаковать товар в " +
		"Китае и проверить его на работоспособность ⚙️ и оформить возврат при наличии дефектов пока это не поздно ⏱️ "
	ans4 = "Данные товары предназначены для внутреннего рынка Китая и многие имеют поддержку только " +
		"китайского 🇨🇳 и английского 🇬🇧языков. \n\nВ случае с телефонами, телевизорами, " +
		"планшетами и прочей подобной техники данный вопрос решается прошивкой 📱\n\nНаша " +
		"команда также предоставляет данную услугу за доп. плату сразу после прихода на склад в " +
		"Москве и после отправится в нужный регион 🎯\n\nТакже прошить устройство можно  самостоятельно " +
		"по нашей инструкции, или же с помощью других специализированных сервисов 🗺️ \n\nВ случае с бытовой " +
		"техникой у вас будет выбор: возможность заменить гравировкой китайские символы на российские за доп. " +
		"плату или же бесплатные наклейки которые идут в комплекте и будут адаптировпны под твою модель 🧑‍🎨  "
	ans5 = "Да, вилка китайская, но для всей техники в комплекте идет  переходник. " +
		"Мы руководствуемся правилом 3️⃣ НЕ: \n\nон НЕ занимает места, никак НЕ влияет на работоспособность и НЕ мешает пользованию "
	ans6 = "Мы возим китайские версии для возможности поддержания низких цен на рынке 🤝 "
	ans7 = "На данный момент товары привозятся только с Китая и только определенных брендов, от тщательно подобранных поставщиков. В дальнейшем планируется вывоз техники из Европы в том числе 🇪🇺 "
	ans8 = "Техника от этого производителя завозится с ОАЭ, Китая, Кореи и Японии 🇯🇵"
)

var (
	questions = []string{q1, q2, q3, q4, q5, q6, q7, q8}
	answers   = []string{ans1, ans2, ans3, ans4, ans5, ans6, ans7, ans8}
)

// i >= 1
func GetQuestion(i int) string {
	return questions[i-1]
}

// i >= 1
func GetAnswer(i int) string {
	return answers[i-1]
}
