{
  "menu": "Здесь ты можешь найти все радости жизни 😌",
  "start": "Привет, %s, рад видеть тебя в боте хКК 👋🏻",
  "catalog": "%s, рад видеть тебя в нашем онлайн магазине! Весь товар в наличии, листай каталог, там есть вся информация.\nПо вопросам покупки пиши админу @xKK_Russia 🫡",
  "cartPreviewStart": "Вот твоя корзина!\nПозиций в корзине: %d\nТип: %s\n\n---\n\n",
  "cartPosition": "%d. Ссылка: %s\nРазмер: %s\nКатегория: %s\nСтоимость в рублях: %d ₽\nСтоимость в юанях: %d ¥\n\n",
  "cartPreviewEnd": "Итого:\nСтоимость в рублях: %d ₽\nСтоимость в юанях: %d ¥\n\nВ стоимость каждой позиции включена страховка и доставка до Москвы\n\n---\n\nГотов заказать? Жми на кнопку!",
  "calculatorOutput": "Итоговая стоимость: %d ₽\n",
  "order": "Вся информация, которую ты указываешь, для сборки в корзине 🧺 должна быть актуальной, если она составляет более 48ч ⌚️и является неактуальной  – заказ не будет принят и деньги возвратятся в полном объеме на карту плательщика 💴\n\n%s - Твоя заявка готова!\n\nНомер заказа: [%s]\nТип заказа: %s\n\nДанные получателя\nФИО: %s\nНомер телефона: %s\nАдрес доставки: %s\n\nТоваров в корзине: %d\n\n",
  "orderEnd": "Итоговая стоимость составляет %d ₽\n\nВысылаю реквизиты для оплаты🧾",
  "requisites": "Счет для оплаты заказа: [%s]\n\nТимофеев Вадим Денисович 💁‍♂️ @xKK_Russia\n\nНомер карты Сбер: %s\nНомер карты Тинькофф: %s\nВ комментарии укажи номер заказа [%s]\n\nПосле оплаты нажми кнопку «Оплачено»\n",
  "guide_step1": "Шаг 1. При открытии приложения открывается новостная лента, заходим в магазин, нажимая на пакет. Нас переносит в магазин, где есть поисковик, который работает на английском языке. Вбиваем название интересующей продукции либо просто модель. Поисковик достаточно точный, поэтому не требует ничего лишнего.",
  "guide_step2": "Шаг 2. Выбираем заинтересовавшую модель. Нажимаем на бирюзовую кнопку справа внизу для выбора размера и ознакомления с ценой.",
  "guide_step3": "Шаг 3. Нажимаем на линейку чтобы лучше понять какому размеру US соответсвует указанный EU на основной табличке (где указаны цены). Мы видим 5 размерных линеей. Перед оформлением заказа кроссовок настоятельно рекомендую забить в интерете следующую фразу «маломерит ли такая-то модель м/ж кроссовок» и изучить данный вопрос, во избежании неприятных ситуаций. После того как мы удостоверелись в информации, можем идти дальше. Переходим по стрелке в левом верхнем углу назад.",
  "guide_step4": "Шаг 4. Выбираем подходящий размер и под ним, снизу можем наблюдать стоимость в юанях, также стоимость будет отображаться на кнопке снизу (их может быть несколько разных цветов). Соответственно  выбираем необходимые условия и отправляем информацию боту, будут предложены варианты.",
  "guide_step5": "Шаг 5. Для копирования ссылки нажимаем на «знак общения». Последняя кнопка, куда необходимо нажать в приложении – сама кнопка ссылки. Потом закрываем всплывающее окно. Переходим в tg.",
  "guide_step6": "Шаг 6. Переходим в любые сообщения и вставляем копируемую ссылку, подчеркнутый текст – вся  необходимая информация по товару, остальное убираем. Отправляем то, что осталось боту. ",
  "afterPaid": "%s, твой заказ %s сейчас на подтверждении у админа. Он напишет тебе в личные сообщения и подтвердит статус покупки.\n\n‼️Никому кроме бота деньги отправлять не нужно‼️Даже админу‼️\n\nТолько админ проверяет поступление денег и обозначает статус покупки ✅",
  "myOrdersStart":"Вот твои заказы, %s!\n\n",
  "myOrdersEnd": "-----------\n\n",
  "singleOrderPreview": "Заказ: %s\nТип доставки: %s\nАдрес доставки: %s\n\nОплачен: %s\nПодтвержден админом: %s\nСтатус заказа: %s\n\nТоваров в корзине: %d\nСумма в рублях: %d ₽\nСумма в юанях: %d ¥\n\nКомментарий админа: %s\n\nТовар(ы):\n"
}
